import React from 'react';
const marquee = "প্রাকৃতিক রূপবৈচিত্র্যে ভরা আমাদের এই বাংলাদেশ। বাংলাদেশ দক্ষিণ এশিয়ার উত্তর পূর্ব অংশে অবস্থিত। বাংলাদেশের উত্তর সীমানা থেকে কিছু দূরে হিমালয় পর্বতমালা এবং দক্ষিণে বঙ্গোপসাগর। পশ্চিমে ভারতের পশ্চিমবঙ্গ, পূর্বে ভারতের ত্রিপুরা, মিজোরাম রাজ্য এবং মায়ানমারের পাহাড়ী এলাকা। অসংখ্য নদ-নদী পরিবেষ্টিত বাংলাদেশ প্রধানত সমতল ভূমি। দেশের উল্লেখযোগ্য নদ-নদী হলো- পদ্মা, ব্রহ্মপুত্র, সুরমা, কুশিয়ারা, মেঘনা ও কর্ণফুলী।";
const dist = ['কুমিল্লা', 'ফেনী', 'ব্রাহ্মণবাড়িয়া', 'রাঙ্গামাটি', 'নোয়াখালী', 'চাঁদপুর', 'লক্ষ্মীপুর', 'চট্টগ্রাম', 'কক্সবাজার', 'খাগড়াছড়ি', 'বান্দরবান', 'সিরাজগঞ্জ', 'পাবনা', 'বগুড়া', 'রাজশাহী', 'নাটোর', 'জয়পুরহাট', 'চাঁপাইনবাবগঞ্জ', 'নওগাঁ', 'যশোর', 'সাতক্ষীরা', 'মেহেরপুর', 'নড়াইল', 'চুয়াডাঙ্গা', 'কুষ্টিয়া','মাগুরা', 'খুলনা', 'বাগেরহাট', 'ঝিনাইদহ', 'ঝালকাঠি', 'পটুয়াখালী', 'পিরোজপুর', 'বরিশাল', 'ভোলা', 'বরগুনা', 'সিলেট', 'মৌলভীবাজার', 'হবিগঞ্জ', 'সুনামগঞ্জ', 'নরসিংদী', 'গাজীপুর', 'শরীয়তপুর', 'নারায়ণগঞ্জ', 'টাঙ্গাইল', 'কিশোরগঞ্জ', 'মানিকগঞ্জ', 'ঢাকা', 'মুন্সিগঞ্জ', 'রাজবাড়ী', 'মাদারীপুর', 'গোপালগঞ্জ', 'ফরিদপুর', 'পঞ্চগড়', 'দিনাজপুর', 'লালমনিরহাট', 'নীলফামারী', 'গাইবান্ধা', 'ঠাকুরগাঁও', 'রংপুর', 'কুড়িগ্রাম', 'শেরপুর', 'ময়মনসিংহ', 'জামালপুর', 'নেত্রকোণা'];
const chittagong = ['কুমিল্লা', 'ফেনী', 'ব্রাহ্মণবাড়িয়া', 'রাঙ্গামাটি', 'নোয়াখালী', 'চাঁদপুর', 'লক্ষ্মীপুর', 'চট্টগ্রাম', 'কক্সবাজার', 'খাগড়াছড়ি', 'বান্দরবান'];
const rajshahi = ['সিরাজগঞ্জ', 'পাবনা', 'বগুড়া', 'রাজশাহী', 'নাটোর', 'জয়পুরহাট', 'চাঁপাইনবাবগঞ্জ', 'নওগাঁ'];
const khulna = ['যশোর', 'সাতক্ষীরা', 'মেহেরপুর', 'নড়াইল', 'চুয়াডাঙ্গা', 'কুষ্টিয়া','মাগুরা', 'খুলনা', 'বাগেরহাট', 'ঝিনাইদহ'];
const barisal = ['ঝালকাঠি', 'পটুয়াখালী', 'পিরোজপুর', 'বরিশাল', 'ভোলা', 'বরগুনা'];
const sylhet = ['সিলেট', 'মৌলভীবাজার', 'হবিগঞ্জ', 'সুনামগঞ্জ'];
const dhaka = ['নরসিংদী', 'গাজীপুর', 'শরীয়তপুর', 'নারায়ণগঞ্জ', 'টাঙ্গাইল', 'কিশোরগঞ্জ', 'মানিকগঞ্জ', 'ঢাকা', 'মুন্সিগঞ্জ', 'রাজবাড়ী', 'মাদারীপুর', 'গোপালগঞ্জ', 'ফরিদপুর'];
const rangpur = ['পঞ্চগড়', 'দিনাজপুর', 'লালমনিরহাট', 'নীলফামারী', 'গাইবান্ধা', 'ঠাকুরগাঁও', 'রংপুর', 'কুড়িগ্রাম'];
const mymensingh = ['শেরপুর', 'ময়মনসিংহ', 'জামালপুর', 'নেত্রকোণা'];
function Zilla(){
    return <div className='wrap'>
      <div className='bold-line'></div>
      <h2 className='heading'><marquee>{marquee}</marquee></h2>
      <div className='bold-line'></div>
      <h1 className='head'>জেলা নির্বাচন করুন</h1>
      <h2 className='dist'>ঢাকা বিভাগের জেলা সমূহ</h2>
      {dhaka.map((item,index)=>{
         return <button key={index}>{item}</button>
     })}
     <h2 className='dist'>চট্টগ্রাম বিভাগের জেলা সমূহ</h2>
     {chittagong.map((item,index)=>{
         return <button key={index}>{item}</button>
     })}
     <h2 className='dist'>রাজশাহী বিভাগের জেলা সমূহ</h2>
     {rajshahi.map((item,index)=>{
         return <button key={index}>{item}</button>
     })}
     <h2 className='dist'>খুলনা বিভাগের জেলা সমূহ</h2>
     {khulna.map((item,index)=>{
         return <button key={index}>{item}</button>
     })}
     <h2 className='dist'>বরিশাল বিভাগের জেলা সমূহ</h2>
     {barisal.map((item,index)=>{
         return <button key={index}>{item}</button>
     })}
     <h2 className='dist'>সিলেট বিভাগের জেলা সমূহ</h2>
     {sylhet.map((item,index)=>{
         return <button key={index}>{item}</button>
     })}
     <h2 className='dist'>রংপুর বিভাগের জেলা সমূহ</h2>
     {rangpur.map((item,index)=>{
         return <button key={index}>{item}</button>
     })}
     <h2 className='dist'>ময়মনসিংহ বিভাগের জেলা সমূহ</h2>
     {mymensingh.map((item,index)=>{
         return <button key={index}>{item}</button>
     })}
     <div className='bold-line2'></div>
    </div>
  }
  export default Zilla;